In [1]:
import pandas as pd
from sklearn.preprocessing import MinMaxScaler

In [2]:
df=pd.read_csv('exp3.csv')
df

    ID       Name   Age    Salary  Experience
0    1      Arjun  25.0   50000.0           2
1    2     Bhavya   NaN   60000.0           3
2    3     Cherry  28.0       NaN           4
3    4    Dhanush  30.0   80000.0           5
4    5      Ellie  22.0   40000.0           1
5    5      Ellie  22.0   40000.0           1
6    6      Gaya3  21.0   30000.0           6
7    7     Harsha   NaN   25000.0           3
8    8    Jagdish  30.0  100000.0           0
9    9  Kalavathi  24.0   20000.0           6
10  10      Laxmi   NaN   10000.0           9

In [3]:
print("Original Dataset :\n",df)

Original Dataset :
     ID       Name   Age    Salary  Experience
0    1      Arjun  25.0   50000.0           2
1    2     Bhavya   NaN   60000.0           3
2    3     Cherry  28.0       NaN           4
3    4    Dhanush  30.0   80000.0           5
4    5      Ellie  22.0   40000.0           1
5    5      Ellie  22.0   40000.0           1
6    6      Gaya3  21.0   30000.0           6
7    7     Harsha   NaN   25000.0           3
8    8    Jagdish  30.0  100000.0           0
9    9  Kalavathi  24.0   20000.0           6
10  10      Laxmi   NaN   10000.0           9

In [4]:
df.isnull().sum()

ID            0
Name          0
Age           3
Salary        1
Experience    0
dtype: int64

In [5]:
df['Age']=df['Age'].mean()

In [6]:
df.isnull().sum()

ID            0
Name          0
Age           0
Salary        1
Experience    0
dtype: int64

In [7]:
df['Salary']=df['Salary'].median()

In [8]:
df.isnull().sum()

ID            0
Name          0
Age           0
Salary        0
Experience    0
dtype: int64

In [10]:
df.drop_duplicates(inplace=True)
df

    ID       Name    Age   Salary  Experience
0    1      Arjun  25.25  40000.0           2
1    2     Bhavya  25.25  40000.0           3
2    3     Cherry  25.25  40000.0           4
3    4    Dhanush  25.25  40000.0           5
4    5      Ellie  25.25  40000.0           1
6    6      Gaya3  25.25  40000.0           6
7    7     Harsha  25.25  40000.0           3
8    8    Jagdish  25.25  40000.0           0
9    9  Kalavathi  25.25  40000.0           6
10  10      Laxmi  25.25  40000.0           9

In [11]:
Scaler=MinMaxScaler()

In [12]:
df.columns

Index(['ID', 'Name', 'Age', 'Salary', 'Experience'], dtype='object')

In [13]:
df[['Age','Salary','Experience']]=Scaler.fit_transform(df[['Age','Salary','Experience']])

In [14]:
df

    ID       Name  Age  Salary  Experience
0    1      Arjun  0.0     0.0    0.222222
1    2     Bhavya  0.0     0.0    0.333333
2    3     Cherry  0.0     0.0    0.444444
3    4    Dhanush  0.0     0.0    0.555556
4    5      Ellie  0.0     0.0    0.111111
6    6      Gaya3  0.0     0.0    0.666667
7    7     Harsha  0.0     0.0    0.333333
8    8    Jagdish  0.0     0.0    0.000000
9    9  Kalavathi  0.0     0.0    0.666667
10  10      Laxmi  0.0     0.0    1.000000